## STEP 1: Install & Import Required Libraries

In [ ]:
# pip install pandas numpy sqlalchemy pymysql

In [3]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
# sqlalchemy â†’ bridge between SQL & Python

## STEP 2: Create SQL Connection

In [8]:
engine = create_engine("mysql+pymysql://root:Sharayu%40%4010@localhost:3306/recruitment_analytics")

## STEP 3: Pull Tables into Pandas DataFrames

In [10]:
candidates_df = pd.read_sql("SELECT * FROM candidates", engine)
candidates_df

,candidate_id,candidate_name,email,phone,experience_years,current_location
0,1,Sneha Mehta,candidate1@email.com,9204759463,1.6,Noida
1,2,Neha Verma,candidate2@email.com,9518915308,11.8,Noida
2,3,Amit Agarwal,candidate3@email.com,9410771620,6.9,Hyderabad
3,4,Rohit Chatterjee,candidate4@email.com,9546285747,11.0,Pune
4,5,Isha Verma,candidate5@email.com,9274154148,14.7,Chennai
...,...,...,...,...,...,...
1095,1096,Kavya Joshi,candidate1096@email.com,9269095509,5.4,Noida
1096,1097,Rohit Naik,candidate1097@email.com,9421663206,14.7,Mumbai
1097,1098,Vikas Chatterjee,candidate1098@email.com,9747063793,14.2,Hyderabad
1098,1099,Riya Naik,candidate1099@email.com,9723968659,8.4,Bangalore
1099,1100,Ankit Reddy,candidate1100@email.com,9772692977,5.5,Hyderabad

In [11]:
applications_df = pd.read_sql("SELECT * FROM applications", engine)
applications_df

,application_id,candidate_id,job_id,source,recruiter_id,application_date,current_status
0,1,1031,8,LinkedIn,11,2024-05-19,Rejected
1,2,210,25,Company Website,11,2024-10-10,Rejected
2,3,351,8,Naukri,10,2024-09-28,Hired
3,4,191,14,Naukri,6,2024-09-19,Rejected
4,5,829,21,Naukri,1,2024-04-17,Rejected
...,...,...,...,...,...,...,...
1511,1645,400,16,Company Website,7,2024-10-14,Hired
1512,1646,344,17,Company Website,10,2024-07-19,Rejected
1513,1647,1061,18,Naukri,5,2024-10-03,Rejected
1514,1649,159,20,Naukri,11,2024-07-23,Rejected
1515,1650,16,21,Company Website,5,2024-12-09,Hired

In [12]:
jobs_df = pd.read_sql("SELECT * FROM jobs", engine)
jobs_df

    job_id           job_title department job_location   open_date  close_date
0        1      Data Scientist         IT    Bangalore  2024-03-22  2024-07-19
1        2        Data Analyst         IT    Bangalore  2024-02-05  2024-06-25
2        3   Backend Developer         IT    Bangalore  2024-02-05  2024-06-01
3        5        Data Analyst         IT    Hyderabad  2024-03-14  2024-09-04
4        6        Data Analyst         IT         Pune  2024-01-02  2024-05-14
5        7      Data Scientist         IT    Hyderabad  2024-03-31  2024-10-12
6        8  Frontend Developer         IT    Hyderabad  2024-03-11  2024-06-09
7        9  Frontend Developer         IT    Bangalore  2024-01-06  2024-04-30
8       10  Frontend Developer         IT    Hyderabad  2024-01-23  2024-06-19
9       12        Data Analyst         IT    Hyderabad  2024-01-13  2024-07-24
10      13   Backend Developer         IT    Hyderabad  2024-01-06  2024-06-28
11      14  Frontend Developer         IT    Hyderabad  2024-01-19  2024-06-04
12      15   Backend Developer         IT    Hyderabad  2024-01-10  2024-07-28
13      16      Data Scientist         IT    Hyderabad  2024-01-11  2024-05-04
14      17         QA Engineer         IT         Pune  2024-02-04  2024-05-22
15      18   Backend Developer         IT    Hyderabad  2024-01-21  2024-06-12
16      19   Backend Developer         IT    Bangalore  2024-03-02  2024-07-20
17      20      Data Scientist         IT    Hyderabad  2024-03-03  2024-09-22
18      21   Backend Developer         IT    Hyderabad  2024-03-18  2024-10-01
19      22   Backend Developer         IT    Hyderabad  2024-03-20  2024-09-11
20      23      Data Scientist         IT    Hyderabad  2024-01-30  2024-06-26
21      24         QA Engineer         IT    Hyderabad  2024-01-19  2024-07-21
22      25        Data Analyst         IT         Pune  2024-01-20  2024-06-10

In [13]:
stages_df = pd.read_sql("SELECT * FROM recruitment_stage_events", engine)
stages_df

,stage_event_id,application_id,stage_name,stage_date,stage_status,drop_reason
0,1,1,Resume Screening,2024-05-24,Rejected,Experience mismatch
1,2,2,Resume Screening,2024-10-12,Rejected,Experience mismatch
2,3,3,Resume Screening,2024-10-03,Selected,
3,4,3,Technical Interview,2024-10-05,Selected,
4,5,3,Managerial Interview,2024-10-11,Selected,
...,...,...,...,...,...,...
4922,5363,1650,Technical Interview,2024-12-15,Selected,
4923,5364,1650,Managerial Interview,2024-12-20,Selected,
4924,5365,1650,HR Interview,2024-12-27,Selected,
4925,5366,1650,Offer Made,2024-12-31,Accepted,
4926,5367,1650,Joined,2025-01-03,Joined,

## STEP 4: Quick Sanity Check

In [14]:
print(applications_df.shape)
print(stages_df.shape)
print(jobs_df.shape)
print(candidates_df.shape)

(1516, 7)
(4927, 6)
(23, 6)
(1100, 6)

## STEP 5: Basic Data Validation

In [15]:
applications_df.head()

,application_id,candidate_id,job_id,source,recruiter_id,application_date,current_status
0,1,1031,8,LinkedIn,11,2024-05-19,Rejected
1,2,210,25,Company Website,11,2024-10-10,Rejected
2,3,351,8,Naukri,10,2024-09-28,Hired
3,4,191,14,Naukri,6,2024-09-19,Rejected
4,5,829,21,Naukri,1,2024-04-17,Rejected

In [16]:
stages_df.head()

,stage_event_id,application_id,stage_name,stage_date,stage_status,drop_reason
0,1,1,Resume Screening,2024-05-24,Rejected,Experience mismatch
1,2,2,Resume Screening,2024-10-12,Rejected,Experience mismatch
2,3,3,Resume Screening,2024-10-03,Selected,
3,4,3,Technical Interview,2024-10-05,Selected,
4,5,3,Managerial Interview,2024-10-11,Selected,

In [17]:
applications_df.isnull().sum()

application_id      0
candidate_id        0
job_id              0
source              0
recruiter_id        0
application_date    0
current_status      0
dtype: int64

## STEP 6 EXPLORATORY DATA ANALYSIS (EDA)

#### CREATE TIME-TO-HIRE DATASET
**Time-to-Hire = Joining Date âˆ’ Application Date**

In [20]:
# Extract Joining Dates
joined_df = stages_df[
    stages_df["stage_name"] == "Joined"
][["application_id", "stage_date"]].rename(
    columns={"stage_date": "joining_date"}
)

In [21]:
#  Merge with Applications
time_to_hire_df = applications_df.merge(
    joined_df,
    on="application_id",
    how="inner"
)

In [22]:
# Convert Date Columns to Datetime ðŸ”¥ (CRITICAL)
time_to_hire_df["application_date"] = pd.to_datetime(
    time_to_hire_df["application_date"]
)

time_to_hire_df["joining_date"] = pd.to_datetime(
    time_to_hire_df["joining_date"]
)

In [23]:
# Calculate Time-to-Hire
time_to_hire_df["time_to_hire_days"] = (
    time_to_hire_df["joining_date"] -
    time_to_hire_df["application_date"]
).dt.days

time_to_hire_df.head()

,application_id,candidate_id,job_id,source,recruiter_id,application_date,current_status,joining_date,time_to_hire_days
0,3,351,8,Naukri,10,2024-09-28,Hired,2024-10-24,26
1,6,86,17,LinkedIn,12,2024-08-13,Hired,2024-09-10,28
2,12,732,1,Company Website,1,2024-12-16,Hired,2025-01-17,32
3,15,522,10,Referral,4,2024-05-27,Hired,2024-06-25,29
4,18,380,5,Naukri,9,2024-07-25,Hired,2024-08-13,19

### What does the time-to-hire distribution look like?

In [24]:
time_to_hire_df["time_to_hire_days"].describe()

count    431.000000
mean      27.238979
std        4.017515
min       17.000000
25%       24.000000
50%       27.000000
75%       30.000000
max       38.000000
Name: time_to_hire_days, dtype: float64

In [25]:
# Identify Long Delays (Outliers)
time_to_hire_df.sort_values(
    by="time_to_hire_days",
    ascending=False
).head(10)

,application_id,candidate_id,job_id,source,recruiter_id,application_date,current_status,joining_date,time_to_hire_days
71,281,287,14,Naukri,9,2024-07-15,Hired,2024-08-22,38
154,573,853,14,LinkedIn,11,2024-09-04,Hired,2024-10-12,38
402,1539,272,25,Referral,4,2024-04-27,Hired,2024-06-04,38
409,1550,878,14,Company Website,12,2024-09-28,Hired,2024-11-04,37
357,1377,37,24,LinkedIn,11,2024-10-17,Hired,2024-11-23,37
47,198,235,21,LinkedIn,6,2024-10-10,Hired,2024-11-16,37
319,1221,200,22,Naukri,6,2024-07-29,Hired,2024-09-04,37
101,365,198,25,Naukri,3,2024-03-14,Hired,2024-04-19,36
344,1327,187,17,LinkedIn,5,2024-10-07,Hired,2024-11-11,35
304,1158,302,21,Company Website,5,2024-10-05,Hired,2024-11-09,35

#### ROLE-WISE TIME-TO-HIRE

### Which roles take longer to close?

In [26]:
role_time_df = time_to_hire_df.merge(
    jobs_df[["job_id", "job_title"]],
    on="job_id",
    how="left"
)

role_time_df.groupby("job_title")["time_to_hire_days"].mean().sort_values(ascending=False)

job_title
QA Engineer           27.400000
Frontend Developer    27.397059
Data Analyst          27.318182
Data Scientist        27.164706
Backend Developer     27.097744
Name: time_to_hire_days, dtype: float64

#### SOURCE vs TIME-TO-HIRE

In [27]:
# Which sources close faster?
time_to_hire_df.groupby("source")["time_to_hire_days"].mean().sort_values()

source
LinkedIn           26.534653
Company Website    26.971698
Naukri             27.410256
Referral           27.981308
Name: time_to_hire_days, dtype: float64

#### EXPERIENCE vs TIME-TO-HIRE

In [29]:
# Does experience affect hiring speed?
exp_df = time_to_hire_df.merge(
    candidates_df[["candidate_id", "experience_years"]],
    on="candidate_id",
    how="left"
)

In [30]:
exp_df.groupby(
    pd.cut(exp_df["experience_years"], bins=[0,2,5,8,12,20])
)["time_to_hire_days"].mean()

C:\Users\irale\AppData\Local\Temp\ipykernel_29372\4141849155.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  exp_df.groupby(

experience_years
(0, 2]      26.980000
(2, 5]      26.675000
(5, 8]      27.636364
(8, 12]     27.726316
(12, 20]    26.906250
Name: time_to_hire_days, dtype: float64